#1) შექმენით 5 ელემენტიანი სია. გადაუარეთ მას for ციკლით და დაბეჭდეთ მისი თითოეული ელემენტი

#2) შექმენით ცვლადი სადაც შეინახავთ ნებისმიერ წინადადებას. გადაუარეთ for ციკლით მას და დაბეჭდეთ წინადადების თითოეული სიმბოლო

#3) პირველ დავალებაში შექმნილ სიას გადაუარეთ while ციკლის გამოყენებით.(მინიშნება: დაგჭირდებათ ცვლადის შექმნა, რომელსაც გაზრდით და გამოიყენებთ მას რომ მიიღოთ წვდომა სიის ინდექსებზე)

number = [1,2,3,4,5]

for i in number:
    print(number)



sentence = "hello world"

for i in sentence:
   print(i)



number = [1,2,3,4,5]

number_two = 0

while number_two < len(number):
    print(number[number_two])
number - 1

