
numberone = "234"
numbertwo = 432

print=(numberone + numbertwo)
print=(numberone - numbertwo)
print=(numberone * numbertwo)
print=(numberone / numbertwo)

hight= input("Enter your hight:")
corection= float(hight)
print(corection)
print(type(corection))

#Data Convertion-მონაცემების ერთ ფორმატიდან მეორეში გადაყვანას. ეს პროცესი საჭიროა, როცა ინფორმაცია შექმნილია ან ინახება კონკრეტულ ფორმატში და ის უნდა გარდაიქმნას სხვად
#implicitly-ქმედებებს ან პროცესებს, რომლებიც პირდაპირ არ არის გაჟღერებული ან აღწერილი, მაგრამ ის იგულისხმება ან შეიძლება ინტერპრეტირდეს კონტექსტიდან.
#explicitly-ქმედებების ან პროცესების გამოკვეთას, რომლებიც პირდაპირ და ნათლად არის გაჟღერებული ან აღწერილი.

#ყველა ფუნქციები (ნასწავლიც და არა ნასწავლიც)

#int()	მონაცემს გარდაქმნის მთელ რიცხვად (integer).	int("42") -> 42
#float()	მონაცემს გარდაქმნის ათწილად რიცხვად (floating-point number).	float("3.14") -> 3.14
#str()	მონაცემს გარდაქმნის სტრინგად (ტექსტური მონაცემი).	str(100) -> "100"
#bool()	მონაცემს გარდაქმნის ლოგიკურ მნიშვნელობად (True ან False).	bool(0) -> False
#list()	მონაცემს გარდაქმნის სიად (list).	list("abc") -> ['a', 'b', 'c']
#tuple()	მონაცემს გარდაქმნის წყვილად (tuple).	tuple([1, 2, 3]) -> (1, 2, 3)
#set()	მონაცემს გარდაქმნის უნიკალურ მნიშვნელობების ნაკრებად (set).	set([1, 2, 2, 3]) -> {1, 2, 3}
#dict()	მონაცემს გარდაქმნის ლექსიკონად (dictionary), რომელიც შეიცავს გასაღებ-ღირებულებების წყვილებს.	dict([(1, 'a'), (2, 'b')]) -> {1: 'a', 2: 'b'}
#chr()	გარდაქმნის მთელ რიცხვს შესაბამის სიმბოლოდ (ASCII კოდით).	chr(65) -> 'A'
#ord()	გარდაქმნის სიმბოლოს შესაბამის ASCII კოდად.	ord('A') -> 65
 