#For - ციკლი პროგრამირებაში საშუალებას გვაძლევს გავიმეოროთ მოქმედებები ან მოვახდინოთ მონაცემების დამუშავება წინასწარ განსაზღვრული რაოდენობის ან ელემენტების მიხედვით. ის მუშაობს ისე, რომ საიტერაციო ცვლადი (iteration variable) იღებს მნიშვნელობას რიგრიგობით range ფუნქციის ან სხვა კოლექციის ელემენტებიდან.

#საიტერაციო ცვლადი - არის ცვლადი, რომელიც for ციკლში ყოველ გამეორებაზე იძენს ახალ მნიშვნელობას. ეს მნიშვნელობები, რიგრიგობით, მოდის იმ კოლექციიდან ან დიაპაზონიდან, რომელიც ციკლშია 

for i in range(50):
  print(i)

for i in range(5):
  print((i)/5)