#სია (List) არის მონაცემთა სტრუქტურა Python-ში, რომელიც საშუალებას გვაძლევს შევინახოთ ერთობლივად რამდენიმე ელემენტი. სიაში შეიძლება შევინახოთ სხვადასხვა ტიპის მონაცემები, როგორიცაა რიცხვები, სტრიქონები, ბულეონის ტიპის მნიშვნელობები და სხვა.სიის შექმნა
#Python-ში სიის შექმნა ძალიან მარტივია. ის შეიძლება დაიწეროს კვადრატული ფრჩხილების ([]) გამოყენებით.


#Python-ში ინდექსი არის ელემენტის მდებარეობა სიაში, ხაზში (string-ში) ან სხვა ინტერაქტიურ მონაცემთა სტრუქტურაში.
#ინდექსი იწყება 0-დან, რაც ნიშნავს, რომ პირველი ელემენტის ინდექსი არის 0, მეორე - 1, მესამე - 2 და ასე შემდეგ.



number = [1,2,3,4,5,6,7]
print(number)

number = [10,2,3,4,50,6,7]
print(number)