#1)
name = "vano"
age = 0
# print(name + "best")

#ეს კოდი არაფერს გამოიტანს რადგან print-ფუნქცია არის კომენტარში

#2)
#კომენტარი- წინადადება რომელიც გვეხმარება კოდის შეცნობაში და გაგებაში
#დებაგი- როდესაც რაიმე შეცდომას(ბაგს) სტრინგში შეასწორებ

#3)1)განიხილეთ ეს კოდი (რას გამოიტანს):

name = "vano"
age = 0
# print(name + "best")

name = "vano"
surname = motiashvili # type: ignore
height = 1 86 # type: ignore
print(name + surname - height)

#1. "1 86"-ში არის გამოტოვება და სწორეა "186"
#2. წინადადებას ვერ გამოაკლებ რიცხვს:ვანო მოტიასჰვილი-186 -არასწორეა უნდა მაიც იყოს: name + surname + height
#3 surname-ს უნდა დავამატოთ ბრჭყალები